copy/Public SOAP API.postman_collection.json

{
	"variables": [],
	"info": {
		"name": "Public SOAP API",
		"_postman_id": "8edf0cc5-ef42-c8b5-ff4c-a4420fc2838a",
		"description": "",
		"schema": "https://schema.getpostman.com/json/collection/v2.0.0/collection.json"
	},
	"item": [
		{
			"name": "Numbers",
			"description": "",
			"item": [
				{
					"name": "NumberToWords",
					"request": {
						"url": "https://www.dataaccess.com/webservicesserver/NumberConversion.wso",
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml",
								"description": ""
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n      <ubiNum>5</ubiNum>\r\n    </NumberToWords>\r\n  </soap:Body>\r\n</soap:Envelope>"
						},
						"description": ""
					},
					"response": []
				},
				{
					"name": "NumberToDollars",
					"request": {
						"url": "https://www.dataaccess.com/webservicesserver/NumberConversion.wso\n",
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml",
								"description": ""
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <NumberToDollars xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n      <dNum>500</dNum>\r\n    </NumberToDollars>\r\n  </soap:Body>\r\n</soap:Envelope>"
						},
						"description": ""
					},
					"response": []
				}
			]
		},
		{
			"name": "Calculator",
			"description": "",
			"item": [
				{
					"name": "Subtract",
					"request": {
						"url": "http://www.dneonline.com/calculator.asmx\n",
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml",
								"description": ""
							},
							{
								"key": "SOAPAction",
								"value": "http://tempuri.org/Subtract\n",
								"description": ""
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <Subtract xmlns=\"http://tempuri.org/\">\r\n      <intA>5</intA>\r\n      <intB>5</intB>\r\n    </Subtract>\r\n  </soap:Body>\r\n</soap:Envelope>"
						},
						"description": ""
					},
					"response": []
				},
				{
					"name": "Add",
					"request": {
						"url": "http://www.dneonline.com/calculator.asmx\n",
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml",
								"description": ""
							},
							{
								"key": "SOAPAction",
								"value": "http://tempuri.org/Add",
								"description": ""
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <Add xmlns=\"http://tempuri.org/\">\r\n      <intA>5</intA>\r\n      <intB>5</intB>\r\n    </Add>\r\n  </soap:Body>\r\n</soap:Envelope>"
						},
						"description": ""
					},
					"response": []
				},
				{
					"name": "Multiply",
					"request": {
						"url": "http://www.dneonline.com/calculator.asmx\n",
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml",
								"description": ""
							},
							{
								"key": "SOAPAction",
								"value": "http://tempuri.org/Multiply\n",
								"description": ""
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <Multiply xmlns=\"http://tempuri.org/\">\r\n      <intA>5</intA>\r\n      <intB>5</intB>\r\n    </Multiply>\r\n  </soap:Body>\r\n</soap:Envelope>"
						},
						"description": ""
					},
					"response": []
				},
				{
					"name": "Divide",
					"request": {
						"url": "http://www.dneonline.com/calculator.asmx\n",
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml",
								"description": ""
							},
							{
								"key": "SOAPAction",
								"value": "http://tempuri.org/Divide",
								"description": ""
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <Divide xmlns=\"http://tempuri.org/\">\r\n      <intA>5</intA>\r\n      <intB>1</intB>\r\n    </Divide>\r\n  </soap:Body>\r\n</soap:Envelope>"
						},
						"description": ""
					},
					"response": []
				}
			]
		},
		{
			"name": "Continents",
			"description": "",
			"item": [
				{
					"name": "List of Continents by Name",
					"request": {
						"url": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso",
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml",
								"description": ""
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\r\n  <soap12:Body>\r\n    <ListOfContinentsByName xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n    </ListOfContinentsByName>\r\n  </soap12:Body>\r\n</soap12:Envelope>"
						},
						"description": ""
					},
					"response": []
				}
			]
		},
		{
			"name": "Countries",
			"description": "",
			"item": []
		}
	]
}